import React from 'react';

const Help = () => {
    return (
        <>
            <div>
                <title>Οδηγίες για τον Ημεροδείκτη</title>
                <h1 style={{ color: 'darkred' }}>Ημεροδείκτης</h1>
                <div>
                    Ο Ημεροδείκτης είναι μια απλή εφαρμογή που προσομοιώνει τους επιτραπέζιους ημεροδείκτες. Δηλαδή
                    προσφέρει πληροφορίες για κάθε ημέρα του έτους.
                </div>
                <ul>
                    <li>Εμφανίζει όλες τις εορτές της Ελληνικής Ορθόδοξης Εκκλησίας, κινητές και ακίνητες.</li>
                    <li>Εμφανίζει τη φάση σελήνης καθώς και τις ώρες ανατολής και δύσης ηλίου.</li>
                    <li>
                        Ο χρήστης μπορεί να <a href="#move">μετακινηθεί</a> σε οποιαδήποτε ημερομηνία.
                    </li>
                    <li>
                        Ο χρήστης μπορεί επίσης να <a href="#search">αναζητήσει</a> μια κινητή εορτή (πχ Καθαρά Δευτέρα,
                        Πάσχα, κλπ) οποιουδήποτε έτους.
                    </li>
                    <li>
                        Προσφέρει δυνατότητα <a href="#search">αναζήτησης</a> στις ακίνητες εορτές με βάση, για
                        παράδειγμα, το όνομα ενός αγίου.
                    </li>
                    <li>
                        Ψάχνει στις "Επαφές" που είναι καταχωρημένες στον Google λογαριασμό του χρήστη και βρίσκει τους
                        <a href="#celebrating">εορτάζοντες</a> της ημέρας, τους οποίους εμφανίζει σε λίστα με τα
                        τηλέφωνα και τις ηλεκτρονικές διευθύνσεις τους.
                    </li>
                    <li>
                        Μπορεί να στείλει μαζικά μήνυμα <a href="#celebrating">e-mail</a> σε όλους (ή σε επιλεγμένους)
                        εορτάζοντες.
                    </li>
                </ul>
                <h2 style={{ color: 'darkred' }}>Λειτουργίες και δυνατότητες της εφαρμογής</h2>
                <h3 style={{ color: 'darkblue' }} id="header">
                    Γραμμή επικεφαλίδας
                </h3>
                <div>
                    Στο δεξί μέρος της γραμμής επικεφαλίδας που υπάρχει στην κορυφή της σελίδας, εμφανίζεται ένας
                    σύνδεσμος με ετικέτα:{' '}
                    <b>
                        <i>Σύνδεση μέσω Google</i>
                    </b>
                    . Αν θέλουμε να χρησιμοποιήσουμε την δυνατότητα να μάθουμε ποιοι από τις <i>επαφές</i> μας έχουν την
                    ονομαστική τους εορτή μια συγκεκριμένη μέρα, θα πρέπει προηγουμένως να συνδεθούμε στο Google. Αφού
                    πατήσουμε τον σύνδεσμο, θα εμφανιστεί ένα πλαίσιο που μας καλεί να επιλέξουμε τον λογαριασμό Google
                    με τον οποίο θέλουμε να συνδεθούμε και στη συνέχεια ένα δεύτερο πλαίσιο μας ζητάει να επιβεβαιώσουμε
                    ότι παραχωρούμε στην εφαρμογή <i>Ημεροδείκτης</i> το δικαίωμα να έχει πρόσβαση στις επαφές μας.
                </div>
                <div>
                    <b>
                        <ul>
                            <li>
                                Εδώ πρέπει να δηλώσουμε πως η εφαρμογή <i>Ημεροδείκτης</i>
                                <u>δεν αποθηκεύει και δεν χρησιμοποιεί καθ'οιονδήποτε τρόπο</u> όλα ή μέρος των
                                στοιχείων των επαφών του χρήστη.
                            </li>
                        </ul>
                    </b>
                </div>
                <div>
                    <p />
                </div>
                <div>
                    <p />
                </div>
                <h3 style={{ color: 'darkblue' }} id="home">
                    Αρχική οθόνη
                </h3>
                <div>
                    Στο δεξί μέρος της σελίδας εμφανίζονται τα δεδομένα της ημέρας. Στο αριστερό μέρος βρίσκονται τα
                    στοιχεία ελέγχου που προσφέρουν τις εξής επιλογές:
                </div>
                <div>
                    <p />
                </div>
                <ul>
                    <li id="move">
                        <b>Μετακίνηση στον χρόνο</b>
                    </li>
                    <div>
                        Στην πρώτη σειρά, με τα βέλη προχωράμε μιά ημέρα μπροστά ή πίσω και με το κουμπί
                        <b>
                            <i>Σήμερα</i>
                        </b>{' '}
                        επιστρέφουμε στην σημερινή ημερομηνία. Στην δεύτερη σειρά, τα βέλη μας οδηγούν ένα μήνα μπροστά
                        ή πίσω.
                    </div>
                    <div>
                        Αμέσως πιο κάτω, αν κάνουμε κλικ δίπλα από την ετικέτα{' '}
                        <b>
                            <i>Ημερομηνία</i>
                        </b>
                        , θα εμφανιστεί ένα πλαίσιο διαλόγου για να μεταβούμε σε οποιαδήποτε ημερομηνία επιθυμούμε.
                    </div>
                    <div>
                        <p />
                    </div>
                    <li id="search">
                        <b>Αναζήτηση</b>
                    </li>
                    <div>
                        Κάτω από την ετικέτα{' '}
                        <b>
                            <i>Αναζήτηση εορτής</i>
                        </b>{' '}
                        εμφανίζεται ένα πλαίσιο αναζήτησης. Αν πατήσουμε το βελάκι στο δεξί μέρος του πλαισίου, θα
                        εμφανιστεί μια λίστα μέ όλες τις εορτές του έτους. Πρώτα εμφανίζονται οι{' '}
                        <b>
                            <i>κινητές εορτές</i>
                        </b>{' '}
                        (ταξινομημένες με χρονολογική σειρά) και κατόπιν οι
                        <b>
                            <i>ακίνητες</i>
                        </b>{' '}
                        (αλφαβητικά).
                    </div>
                    <div>
                        Εναλλακτικά μπορούμε να αρχίσουμε να πληκτρολογούμε μέρος του ονόματος της εορτής που
                        αναζητούμε, και η λίστα που θα εμφανιστεί θα περιέχει τις εορτές που ταιριάζουν με αυτό που
                        γράφουμε.
                    </div>
                </ul>
                <h3 style={{ color: 'darkblue' }} id="celebrating">
                    Εορτάζοντες
                </h3>
                <div>
                    <b>
                        Όπως αναφέρθηκε και παραπάνω, για να μπορέσουμε να χρησιμοποιήσουμε τη συγκεκριμένη δυνατότητα,
                        θα πρέπει προηγουμένως να <a href="#header">συνδεθούμε στο Google</a>.
                    </b>
                </div>
                <div>
                    <p />
                </div>
                <div>
                    Αν πατήσουμε το κουμπί{' '}
                    <b>
                        <i>Εορτάζοντες</i>
                    </b>{' '}
                    η εφαρμογή θα προσπαθήσει να βρει στις επαφές που έχουμε καταχωρήσει στο Google, πρόσωπα που έχουν
                    την ονομαστική τους εορτή την συγκεκριμένη ημέρα. Αν δεν υπάρχουν εορτάζοντες, θα ενημερωθούμε με
                    σχετικό μήνυμα. Αν βρεθούν, τότε ξεκινάει μια διαδικασία από 3 διαδοχικές οθόνες (wizard):
                </div>
                <ol>
                    <li style={{ color: 'darkgreen' }}>
                        <b>Λίστα εορταζόντων - Επιλογή παραληπτών μηνύματος</b>
                    </li>
                    <div>
                        Εμφανίζεται ένας πίνακας με τα στοιχεία των εορταζόντων: ονοματεπώνυμο, email, τηλέφωνο. Η λίστα
                        παρουσιάζεται σε σελίδες των 10 ατόμων η κάθε μία. Για μετακίνηση στην επόμενη ή προηγούμενη
                        σελίδα πατάμε τα κουμπιά <b>&gt;</b> και <b>&lt;</b> αντίστοιχα, που βρίσκονται ακριβώς κάτω από
                        τον πίνακα και δεξιά.
                    </div>
                    <div>
                        Αν θέλουμε να προχωρήσουμε στην αποστολή μηνύματος σε εορτάζοντες, πρέπει να επιλέξουμε τους
                        παραλήπτες κάνοντας κλικ στα τετραγωνάκια που βρίσκονται αριστερά από κάθε εγγραφή. Για να
                        τους/τις επιλέξουμε όλους/ες, κάνουμε κλικ στο τετραγωνάκι που βρίσκεται στην γραμμή των
                        ετικετών του πίνακα. Στη συνέχεια πατάμε το κουμπί{' '}
                        <b>
                            <i>Επόμενο</i>
                        </b>
                        .
                    </div>
                    <div>
                        Για να επιστρέψουμε στην αρχική οθόνη χωρίς να αποστείλουμε μήνυμα, πατάμε{' '}
                        <b>
                            <i>Άκυρο</i>
                        </b>
                    </div>
                    <div>
                        <p />
                    </div>
                    <li style={{ color: 'darkgreen' }} id="email">
                        <b>Σύνταξη μηνύματος</b>
                    </li>
                    <div>
                        Στην σελίδα αυτή μπορούμε να γράψουμε το μήνυμα που θα αποστείλουμε στους επιλεγμένους
                        αποδέκτες. Εμφανίζονται δύο πεδία για συμπλήρωση: <i>Θέμα</i> και <i>Κείμενο</i>. Και τα δύο
                        είναι υποχρεωτικά. Μετά την συμπλήρωση, πατάμε το κουμπί{' '}
                        <b>
                            <i>Επόμενο</i>
                        </b>{' '}
                        για να προχωρήσουμε στην επόμενη οθόνη. Με το κουμπί{' '}
                        <b>
                            <i>Προηγούμενο</i>
                        </b>{' '}
                        επιστρέφουμε στην λίστα εορταζόντων.
                    </div>
                    <div>
                        <p />
                    </div>
                    <li style={{ color: 'darkgreen' }}>
                        <b>Επαλήθευση και αποστολή</b>
                    </li>
                    <div>
                        Στην σελίδα αυτή καλούμαστε να επαληθεύσουμε τα δεδομένα που έχουμε εισαγάγει, δηλαδή τους
                        παραλήπτες και τα στοιχεία του μηνύματος (θέμα, κείμενο). Αν όλα είναι εντάξει, πατάμε{' '}
                        <b>
                            <i>Αποστολή</i>
                        </b>{' '}
                        για να αποσταλεί το μήνυμα. Αλλιώς, πατάμε{' '}
                        <b>
                            <i>Προηγούμενο</i>
                        </b>{' '}
                        για επιστροφή στις προηγούμενες σελίδες.
                    </div>
                </ol>
                <div>
                    <p />
                </div>
                Αφού πατήσουμε{' '}
                <b>
                    <i>Αποστολή</i>
                </b>
                , η εφαρμογή επιστρέφει στην <a href="#home">αρχική οθόνη</a>, ενώ στο παρασκήνιο αποστέλλεται το μήνυμα
                στους αποδέκτες.{' '}
                <b>Η αποστολή αυτή μπορεί να διαρκέσει αρκετά δευτερόλεπτα, ανάλογα με το πλήθος των παραληπτών</b>.
                Όταν η διαδικασία ολοκληρωθεί, ο χρήστης θα ειδοποιηθεί με μήνυμα στην οθόνη για την επιτυχία της
                αποστολής ή για πιθανό πρόβλημα.
            </div>
        </>
    );
};

export default Help;
